package com.vivek.hack.katha_app;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.Menu;
import android.view.MenuItem;
import android.webkit.WebView;
import android.widget.ImageView;
import android.widget.TextView;

public class katha_detail extends AppCompatActivity {
ImageView image;
    TextView t1,t2,t3;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(com.vivek.hack.katha_app.R.layout.activity_katha_detail);
        String s = getIntent().getStringExtra("Data");
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);

if(s.equals("zero")) {
    image = (ImageView) (findViewById(com.vivek.hack.katha_app.R.id.imageView));
    image.setImageResource(com.vivek.hack.katha_app.R.drawable.img1);
    t1 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt1));
    t1.setText("श्रावण सोमवार व्रत कथा");
    t2 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt2));
    t2.setText("व्रत की विधि");
    TextView textnew;

    textnew = (TextView)(findViewById(R.id.txt3));



    String text;

    text = "स्कंदपुराण के अनुसार भगवान शिव को प्रसन्न करने के लिए सावन सोमवार के दिन एक समय भोजन करने का प्रण लेना चाहिए। \n\nभगवान भोलेनाथ के साथ पार्वती जी की पुष्प, धूप, दीप और जल से पूजा करनी चाहिए। \n\nइसके बाद भगवान शिव को तरह-तरह के नैवेद्य अर्पित करने चाहिए जैसे दूध, जल, कंद मूल आदि।\n\n" +
            "सावन के प्रत्येक सोमवार को भगवान शिव को जल अवश्य अर्पित करना चाहिए।\n\nरात्रि के समय जमीन पर सोना चाहिए।\n\n" +
            "इस तरह से सावन के प्रथम सोमवार से शुरु करके कुल नौ या सोलह सोमवार इस व्रत का पालन करना चाहिए।\n\n नौवें या सोलहवें सोमवार को व्रत का उद्यापन करना चाहिए।\n\n अगर नौ या सोलह सोमवार व्रत करना संभव ना हो तो केवल सावन के चार सोमवार भी व्रत किए जा सकते हैं।";

textnew.setText(text);
    t3 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt4));
    t3.setText("व्रत की कथा:");

    TextView detail;
    detail = (TextView)(findViewById(R.id.txt5));
    String text1;
    text1 = "\nश्रावण सोमवार की कथा के अनुसार अमरपुर नगर में एक धनी व्यापारी रहता था। दूर-दूर तक उसका व्यापार फैला हुआ था। नगर में उस व्यापारी का सभी लोग मान-सम्मान करते थे। इतना सबकुछ होने पर भी वह व्यापारी अंतर्मन से बहुत दुखी था क्योंकि उस व्यापारी का कोई पुत्र नहीं था।\n\n" +
            "दिन-रात उसे एक ही चिंता सताती रहती थी। उसकी मृत्यु के बाद उसके इतने बड़े व्यापार और धन-संपत्ति को कौन संभालेगा। पुत्र पाने की इच्छा से वह व्यापारी प्रति सोमवार भगवान शिव की व्रत-पूजा किया करता था। सायंकाल को व्यापारी शिव मंदिर में जाकर भगवान शिव के सामने घी का दीपक जलाया करता था।\n\n" +
            "उस व्यापारी की भक्ति देखकर एक दिन पार्वती ने भगवान शिव से कहा- 'हे प्राणनाथ, यह व्यापारी आपका सच्चा भक्त है। कितने दिनों से यह सोमवार का व्रत और पूजा नियमित कर रहा है। भगवान, आप इस व्यापारी की मनोकामना अवश्य पूर्ण करें। भगवान शिव ने मुस्कराते हुए कहा- 'हे पार्वती! इस संसार में सबको उसके कर्म के अनुसार फल की प्राप्ति होती है। प्राणी जैसा कर्म करते हैं, उन्हें वैसा ही फल प्राप्त होता है\n\n" +
            "इसके बावजूद पार्वतीजी नहीं मानीं। उन्होंने आग्रह करते हुए कहा- 'नहीं प्राणनाथ! आपको इस व्यापारी की इच्छा पूरी करनी ही पड़ेगी। यह आपका अनन्य भक्त है। प्रति सोमवार आपका विधिवत व्रत रखता है और पूजा-अर्चना के बाद आपको भोग लगाकर एक समय भोजन ग्रहण करता है। आपको इसे पुत्र-प्राप्ति का वरदान देना ही होगा।\n\n" +
            "पार्वती का इतना आग्रह देखकर भगवान शिव ने कहा- 'तुम्हारे आग्रह पर मैं इस व्यापारी को पुत्र-प्राप्ति का वरदान देता हूं। लेकिन इसका पुत्र 16 वर्ष से अधिक जीवित नहीं रहेगा।\n\n" +
            "उसी रात भगवान शिव ने स्वप्न में उस व्यापारी को दर्शन देकर उसे पुत्र-प्राप्ति का वरदान दिया और उसके पुत्र के 16 वर्ष तक जीवित रहने की बात भी बताई. भगवान के वरदान से व्यापारी को खुशी तो हुई, लेकिन पुत्र की अल्पायु की चिंता ने उस खुशी को नष्ट कर दिया। व्यापारी पहले की तरह सोमवार का विधिवत व्रत करता रहा। कुछ महीने पश्चात उसके घर अति सुंदर पुत्र उत्पन्न हुआ। पुत्र जन्म से व्यापारी के घर में खुशियां भर गईं। बहुत धूमधाम से पुत्र-जन्म का समारोह मनाया गया।\n\n" +
            "व्यापारी को पुत्र-जन्म की अधिक खुशी नहीं हुई क्योंकि उसे पुत्र की अल्प आयु के रहस्य का पता था। यह रहस्य घर में किसी को नहीं मालूम था। विद्वान ब्राह्मणों ने उस पुत्र का नाम अमर रखा।\n\n" +
            "जब अमर 12 वर्ष का हुआ तो शिक्षा के लिए उसे वाराणसी भेजने का निश्चय हुआ। व्यापारी ने अमर के मामा दीपचंद को बुलाया और कहा कि अमर को शिक्षा प्राप्त करने के लिए वाराणसी छोड़ आओ। अमर अपने मामा के साथ शिक्षा प्राप्त करने के लिए चल दिया। रास्ते में जहां भी अमर और दीपचंद रात्रि विश्राम के लिए ठहरते, वहीं यज्ञ करते और ब्राह्मणों को भोजन कराते थे।\n\n" +
            "लंबी यात्रा के बाद अमर और दीपचंद एक नगर में पहुंचे। उस नगर के राजा की कन्या के विवाह की खुशी में पूरे नगर को सजाया गया था। निश्चित समय पर बारात आ गई लेकिन वर का पिता अपने बेटे के एक आंख से काने होने के कारण बहुत चिंतित था। उसे इस बात का भय सता रहा था कि राजा को इस बात का पता चलने पर कहीं वह विवाह से इनकार न कर दें। इससे उसकी बदनामी होगी।\n\n" +
            "वर के पिता ने अमर को देखा तो उसके मस्तिष्क में एक विचार आया। उसने सोचा क्यों न इस लड़के को दूल्हा बनाकर राजकुमारी से विवाह करा दूं। विवाह के बाद इसको धन देकर विदा कर दूंगा और राजकुमारी को अपने नगर में ले जाऊंगा।\n\n" +
            "वर के पिता ने इसी संबंध में अमर और दीपचंद से बात की। दीपचंद ने धन मिलने के लालच में वर के पिता की बात स्वीकार कर ली। अमर को दूल्हे के वस्त्र पहनाकर राजकुमारी चंद्रिका से विवाह करा दिया गया। राजा ने बहुत-सा धन देकर राजकुमारी को विदा किया।\n\n" +
            "अमर जब लौट रहा था तो सच नहीं छिपा सका और उसने राजकुमारी की ओढ़नी पर लिख दिया- 'राजकुमारी चंद्रिका, तुम्हारा विवाह तो मेरे साथ हुआ था, मैं तो वाराणसी में शिक्षा प्राप्त करने जा रहा हूं। अब तुम्हें जिस नवयुवक की पत्नी बनना पड़ेगा, वह काना है।\n\n" +
            "जब राजकुमारी ने अपनी ओढ़नी पर लिखा हुआ पढ़ा तो उसने काने लड़के के साथ जाने से इनकार कर दिया। राजा ने सब बातें जानकर राजकुमारी को महल में रख लिया। उधर अमर अपने मामा दीपचंद के साथ वाराणसी पहुंच गया | अमर ने गुरुकुल में पढ़ना शुरू कर दिया।\n\n" +
            "जब अमर की आयु 16 वर्ष पूरी हुई तो उसने एक यज्ञ किया। यज्ञ की समाप्ति पर ब्राह्मणों को भोजन कराया और खूब अन्न, वस्त्र दान किए। रात को अमर अपने शयनकक्ष में सो गया। शिव के वरदान के अनुसार शयनावस्था में ही अमर के प्राण-पखेरू उड़ गए। सूर्योदय पर मामा अमर को मृत देखकर रोने-पीटने लगा। आसपास के लोग भी एकत्र होकर दुःख प्रकट करने लगे।\n\n" +
            "मामा के रोने, विलाप करने के स्वर समीप से गुजरते हुए भगवान शिव और माता पार्वती ने भी सुने। पार्वतीजी ने भगवान से कहा- 'प्राणनाथ! मुझसे इसके रोने के स्वर सहन नहीं हो रहे। आप इस व्यक्ति के कष्ट अवश्य दूर करें। भगवान शिव ने पार्वतीजी के साथ अदृश्य रूप में समीप जाकर अमर को देखा तो पार्वतीजी से बोले- 'पार्वती! यह तो उसी व्यापारी का पुत्र है। मैंने इसे 16 वर्ष की आयु का वरदान दिया था। इसकी आयु तो पूरी हो गई।\n\n" +
            "पार्वतीजी ने फिर भगवान शिव से निवेदन किया- 'हे प्राणनाथ! आप इस लड़के को जीवित करें। नहीं तो इसके माता-पिता पुत्र की मृत्यु के कारण रो-रोकर अपने प्राणों का त्याग कर देंगे। इस लड़के का पिता तो आपका परम भक्त है। वर्षों से सोमवार का व्रत करते हुए आपको भोग लगा रहा है।' पार्वती के आग्रह करने पर भगवान शिव ने उस लड़के को जीवित होने का वरदान दिया और कुछ ही पल में वह जीवित होकर उठ बैठा।\n\n" +
            "शिक्षा समाप्त करके अमर मामा के साथ अपने नगर की ओर चल दिया। दोनों चलते हुए उसी नगर में पहुंचे, जहां अमर का विवाह हुआ था। उस नगर में भी अमर ने यज्ञ का आयोजन किया। समीप से गुजरते हुए नगर के राजा ने यज्ञ का आयोजन देखा। राजा ने अमर को तुरंत पहचान लिया। यज्ञ समाप्त होने पर राजा अमर और उसके मामा को महल में ले गया और कुछ दिन उन्हें महल में रखकर बहुत-सा धन, वस्त्र देकर राजकुमारी के साथ विदा किया।\n\n" +
            "रास्ते में सुरक्षा के लिए राजा ने बहुत से सैनिकों को भी साथ भेजा। दीपचंद ने नगर में पहुंचते ही एक दूत को घर भेजकर अपने आगमन की सूचना भेजी। अपने बेटे अमर के जीवित वापस लौटने की सूचना से व्यापारी बहुत प्रसन्न हुआ।\n\n" +
            "व्यापारी ने अपनी पत्नी के साथ स्वयं को एक कमरे में बंद कर रखा था। भूखे-प्यासे रहकर व्यापारी और उसकी पत्नी बेटे की प्रतीक्षा कर रहे थे। उन्होंने प्रतिज्ञा कर रखी थी कि यदि उन्हें अपने बेटे की मृत्यु का समाचार मिला तो दोनों अपने प्राण त्याग देंगे।\n\n" +
            "व्यापारी अपनी पत्नी और मित्रों के साथ नगर के द्वार पर पहुंचा। अपने बेटे के विवाह का समाचार सुनकर, पुत्रवधू राजकुमारी चंद्रिका को देखकर उसकी खुशी का ठिकाना न रहा। उसी रात भगवान शिव ने व्यापारी के स्वप्न में आकर कहा- 'हे श्रेष्ठी! मैंने तेरे सोमवार के व्रत करने और व्रतकथा सुनने से प्रसन्न होकर तेरे पुत्र को लंबी आयु प्रदान की है।' व्यापारी बहुत प्रसन्न हुआ।\n\n" +
            "सोमवार का व्रत करने से व्यापारी के घर में खुशियां लौट आईं। शास्त्रों में लिखा है कि जो स्त्री-पुरुष सोमवार का विधिवत व्रत करते और व्रतकथा सुनते हैं उनकी सभी इच्छाएं पूरी होती हैं।\n\n";
    detail.setText(text1);
}
        if(s.equals("one")) {
            image = (ImageView) (findViewById(com.vivek.hack.katha_app.R.id.imageView));
            image.setImageResource(com.vivek.hack.katha_app.R.drawable.img2);
            t1 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt1));
            t1.setText("संतोषी माता व्रत-कथा");
            t2 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt2));
            t2.setText("व्रत की विधि");

            TextView textnew;

            textnew = (TextView)(findViewById(R.id.txt3));

            String text;

            text = "\nसूर्योदय से पहले उठकर घर की सफ़ाई इत्यादि पूर्ण कर लें. स्नानादि के पश्चात घर में किसी सुन्दर व पवित्र जगह पर माता संतोषी की प्रतिमा या चित्र स्थापित करें.\n\n" +
                    "* माता संतोषी के संमुख एक कलश जल भर कर रखें. कलश के ऊपर एक कटोरा भर कर गुड़ व चना रखें.\n\n" +
                    "* माता के समक्ष एक घी का दीपक जलाएं.\n\n" +
                    "* माता को अक्षत, फ़ूल, सुगन्धित गंध, नारियल, लाल वस्त्र या चुनरी अर्पित करें.\n\n" +
                    "* माता संतोषी को गुड़ व चने का भोग लगाएँ.\n\n";

           textnew.setText(text);

            t3 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt4));
            t3.setText("व्रत की कथा:");

            TextView detail;
            detail = (TextView)(findViewById(R.id.txt5));
            String text1;

            text1 = "\nएक बुढ़िया थी उसका एक ही पुत्र था बुढ़िया पुत्र के विवाह के बाद बहू से घर के सारे काम करवाती, परंतु उसे ठीक से खाना नहीं देती थी. यह सब लड़का देखता पर मां से कुछ भी नहीं कह पाता. बहू दिनभर काम में लगी रहती- उपले थापती, रोटी-रसोई करती, बर्तन साफ करती, कपड़े धोती और इसी में उसका सारा समय बीत जाता.\n\n" +
                    "काफी सोच-विचारकर एक दिन लड़का मां से बोला- `मां, मैं परदेस जा रहा हूं.´ मां को बेटे की बात पसंद आ गई तथा उसे जाने की आज्ञा दे दी. इसके बाद वह अपनी पत्नी के पास जाकर बोला- `मैं परदेस जा रहा हूं. अपनी कुछ निशानी दे दे बहू बोली- `मेरे पास तो निशानी देने योग्य कुछ भी नहीं है. यह कहकर वह पति के चरणों में गिरकर रोने लगी.\n\n" +
                    "इससे पति के जूतों पर गोबर से सने हाथों से छाप बन गई. पुत्र के जाने बाद सास के अत्याचार बढ़ते गए. एक दिन बहू दु:खी हो मंदिर चली गई. वहां उसने देखा कि बहुत-सी स्त्रियां पूजा कर रही थीं. उसने स्त्रियों से व्रत के बारे में जानकारी ली तो वे बोलीं कि हम संतोषी माता का व्रत कर रही हैं. इससे सभी प्रकार के कष्टों का नाश होता है. स्त्रियों ने बताया- शुक्रवार को नहा-धोकर एक लोटे में शुद्ध जल ले गुड़-चने का प्रसाद लेना तथा सच्चे मन से मां का पूजन करना चाहिए. खटाई भूल कर भी मत खाना और न ही किसी को देना. एक वक्त भोजन करना व्रत विधान सुनकर अब वह प्रति शुक्रवार को संयम से व्रत करने लगी. माता की कृपा से कुछ दिनों के बाद पति का पत्र आया. कुछ दिनों बाद पैसा भी आ गया. उसने प्रसन्न मन से फिर व्रत किया तथा मंदिर में जा अन्य स्त्रियों से बोली- `संतोषी मां की कृपा से हमें पति का पत्र तथा रुपया आया है.´ अन्य सभी स्त्रियां भी श्रद्धा से व्रत करने लगीं. बहू ने कहा - हे मां! जब मेरा पति घर आ जाएगा तो मैं तुम्हारे व्रत का उद्यापन करूंगी.\n\n" +
                    "एक रात संतोषी मां ने उसके पति को स्वप्न दिया और कहा कि तुम अपने घर क्यों नहीं जाते? तो वह कहने लगा- सेठ का सारा सामान अभी बिका नहीं. रुपया भी अभी नहीं आया है. उसने सेठ को स्वप्न की सारी बात कही तथा घर जाने की इजाजत मांगी. पर सेठ ने इनकार कर दिया. मां की कृपा से कई व्यापारी आए , सोना-चांदी तथा अन्य सामान खरीदकर ले गए. कर्जदार भी रुपया लौटा गए. अब तो साहूकार ने उसे घर जाने की इजाजत दे दी.\n\n" +
                    "घर आकर पुत्र ने अपनी मां व पत्नी को बहुत सारे रुपये दिए. पत्नी ने कहा कि मुझे संतोषी माता के व्रत का उद्यापन करना है. उसने सभी को न्योता दे उद्यापन की सारी तैयारी की. पड़ोस की एक स्त्री उसे सुखी देख ईष्र्या करने लगी थी. उसने अपने बच्चों को सिखा दिया कि तुम भोजन के समय खटाई जरूर मांगना. उद्यापन के समय खाना खाते-खाते बच्चे खटाई के लिए मचल उठे. तो बहू ने पैसा देकर उन्हें बहलाया. बच्चे दुकान से उन पैसों की इमली-खटाई खरीदकर खाने लगे. तो बहू पर माता ने कोप किया. राजा के दूत उसके पति को पकड़कर ले जाने लगे. तो किसी ने बताया कि उद्यापन में बच्चों ने पैसों की इमली खटाई खाई है तो बहू ने पुन: व्रत के उद्यापन का संकल्प किया.\n\n" +
                    "संकल्प के बाद वह मंदिर से निकली तो राह में पति आता दिखाई दिया. पति बोला- इतना धन जो कमाया है, उसका टैक्स राजा ने माँगा था. अगले शुक्रवार को उसने फिर विधिवत व्रत का उद्यापन किया. वह दुबारा पति की आज्ञा से उद्यापन करने लगी. उसने फिर जेठ के लड़को को बुलावा दिया. जेठानियों ने फिर वहीं बात सिखा दी. लड़के भोजन की बात पर फिर खटाई माँगने लगे. उसने कहा ‘ खटाई कुछ भी नहीं मिलेगी आना हो तो आओ.’ यह कहकर वह ब्राह्मणों के लड़को को लाकर भोजन कराने लगी. यथाशक्ति उसने उन्हें दक्षिणा दी. संतोषी माता उस पर बड़ी प्रसन्न हुई, माता की कृपा से नवमे मास में उसके एक चंद्रमा के समान सुन्दर पुत्र हुआ. अपने पुत्र को लेकर वह रोजाना मंदिर जाने लगी.\n\n" +
                    "एक दिन संतोषी माता ने सोचा कि यह रोज़ यहाँ आती है. आजमैं इसके घर चलूँ. इसका सासरा देखूं. यह सोचकर उसने एक भयानक रूप बनाया. गुड व् चने से सना मुख, ऊपर को सूँड के समान होठ जिन पर मक्खियां भिनभिना रही थी. इसी सूरत में वह उसके घर गई. देहली में पाँव रखते ही उसकी सास बोली ‘ देखो कोई डाकिन आ रही है, इसे भगाओ नहीं तो किसी को खा जायेगी.’ लड़के भागकर खिड़की बन्द करने लगे. सातवे लड़के की बहु खिड़की से देख रही थी. वह वही से चिल्लाने लगी ” आज मेरी माता मेरे ही घर आई है.’ यह कहकर उसने बच्चे को दूध पीने से हटाया. इतने में सास बोली ‘ पगली किसे देख कर उतावली हुई है, बच्चे को पटक दिया है.’\n\n" +
                    "इतने में संतोषी माता के प्रताप से वहाँ लड़के ही लड़के नज़र आने लगे. बहू बोली ” सासूजी मैं जिसका व्रत करती हूँ, यह वो ही संतोषी माता हैं. यह कह कर उसने सारी खिड़कियां खोल दी. सबने संतोषी माता के चरण पकड़ लिए और विनती कर कहने लगे – “हे माता ! हम मूर्ख हैं, अज्ञानी है, पापिनी है, तुम्हारे व्रत की विधि हम नहीं जानती, तुम्हारा व्रत भंग कर हमने बहुत बड़ा अपराध किया है. हे जगत माता ! आप हमारा अपराध क्षमा करो.” इस पर माता उन पर प्रसन्न हुई. बहू को जैसा फल दिया वैसा माता सबको दें.\n\n";
            detail.setText(text1);
        }
        if(s.equals("two")) {
            image = (ImageView) (findViewById(com.vivek.hack.katha_app.R.id.imageView));
            image.setImageResource(com.vivek.hack.katha_app.R.drawable.img3);
            t1 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt1));
            t1.setText("बृहस्पति देव व्रत-कथा");
            t2 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt2));
            t2.setText("व्रत की विधि");

            TextView textnew;

            textnew = (TextView)(findViewById(R.id.txt3));
            String text;

            text = "गुरुवार की पूजा विधि-विधान के अनुसार की जानी चाहिए. व्रत वाले दिन सुबह उठकर बृहस्पति देव का पूजन करना चाहिए. बृहस्पति देव का पूजन पीली वस्तुएं, पीले फूल, चने की दाल, मुनक्का, पीली मिठाई, पीले चावल और हल्दी चढ़ाकर किया जाता है. इस व्रत में केले के पेड़ की पूजा की जाती है. कथा और पूजन के समय मन, कर्म और वचन से शुद्ध होकर मनोकामना पूर्ति के लिए बृहस्पतिदेव से प्रार्थना करनी चाहिए." +
                    "जल में हल्दी डालकर केले के पेड़ पर चढ़ाएं. केले की जड़ में चने की दाल और मुनक्का चढ़ाएं साथ ही दीपक जलाकर पेड़ की आरती उतारें. दिन में एक समय ही भोजन करें. खाने में चने की दाल या पीली चीजें खाएं, नमक न खाएं, पीले वस्त्र पहनें, पीले फलों का इस्तेमाल करें. पूजन के बाद भगवान बृहस्पति की कथा सुननी चाहिए.";


textnew.setText(text);
            t3 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt4));
            t3.setText("व्रत की कथा:");


            TextView detail;
            detail = (TextView)(findViewById(R.id.txt5));
            String text1;

            text1 = "\n प्राचीन समय की बात है – एक बड़ा प्रतापी तथा दानी राजा था । वह प्रत्येक गुरुवार को व्रत रखता एवं पूजा करता था यह उसकी रानी को अच्छा न लगता । न वह व्रत करती और न ही किसी को एक पैसा दान में देती । राजा को भी ऐसा करने से मना किया करती । एक समय की बात है कि राजा शिकार खेलने वन को चले गए । घर पर रानी और दासी थी । उस समय गुरु वृहस्पति साधु का रुप धारण कर राजा के दरवाजे पर भिक्षा मांगने आए । साधु ने रानी से भिक्षा मांगी तो वह कहने लगी, हे साधु महाराज । मैं इस दान और पुण्य से तंग आ गई हूँ । आप कोई ऐसा उपाय बताएं, जिससे यह सारा धन नष्ट हो जाये और मैं आराम से रह सकूं ।\n\n" +
                    "साधु रुपी वृहस्पति देव ने कहा, हे देवी । तुम बड़ी विचित्र हो । संतान और धन से भी कोई दुखी होता है, अगर तुम्हारे पास धन अधिक है तो इसे शुभ कार्यों में लगाओ, जिससे तुम्हारे दोनों लोक सुधरें ।\n\n" +
                    "परन्तु साधु की इन बातों से रानी खुश नहीं हुई । उसने कहा, मुझे ऐसे धन की आवश्यकता नहीं, जिसे मैं दान दूं तथा जिसको संभालने में ही मेरा सारा समय नष्ट हो जाये ।\n\n" +
                    "साधु ने कहा, यदि तुम्हारी ऐसी इच्छा है तो जैसा मैं तुम्हें बताता हूं तुम वैसा ही करना । वृहस्पतिवार के दिन तुम घर को गोबर से लीपना, अपने केशों को पीली मिट्टी से धोना, केशों को धोते समय स्नान करना, राजा से हजामत बनाने को कहना, भोजन में मांस मदिरा खाना, कपड़ा धोबी के यहाँ धुलने डालना । इस प्रकार सात वृहस्पतिवार करने से तुम्हारा समस्त धन नष्ट हो जायेगा । इतना कहकर साधु बने वृहस्पतिदेव अंतर्धान हो गये ।\n\n" +
                    "साधु के कहे अनुसार करते हुए रानी को केवल तीन वृहस्पतिवार ही बीते थे कि उसकी समस्त धन-संपत्ति नष्ट हो गई । भोजन के लिये परिवार तरसने लगा । एक दिन राजा रानी से बोला, हे रानी । तुम यहीं रहो, मैं दूसरे देश को जाता हूँ, क्योंकि यहां पर मुझे सभी जानते है । इसलिये मैं कोई छोटा कार्य नही कर सकता । ऐसा कहकर राजा परदेश चला गया । वहां वह जंगल से लकड़ी काटकर लाता और शहर में बेचता । इस तरह वह अपना जीवन व्यतीत करने लगा ।\n\n" +
                    "इधर, राजा के बिना रानी और दासी दुखी रहने लगीं । एक समय जब रानी और दासियों को सात दिन बिना भोजन के रहना पड़ा, तो रानी ने अपनी दासी से कहा, हे दासी । पास ही के नगर में मेरी बहन रहती है । वह बड़ी धनवान है । तू उसके पास जा और कुछ ले आ ताकि थोड़ा-बहुत गुजर-बसर हो जाए ।\n\n" +
                    "दासी रानी की बहन के पास गई । उस दिन वृहस्पतिवार था । रानी का बहन उस समय वृहस्पतिवारकी कथा सुन रही थी । दासी ने रानी की बहन को अपनी रानी का संदेश दिया, लेकिन रानी की बहन ने कोई उत्तर नहीं दिया । जब दासी को रानी की बहन से कोई उत्तर नहीं मिला तो वह बहुत दुखी हुई । उसे क्रोध भी आया । दासी ने वापस आकर रानी को सारी बात बता दी । सुनकर, रानी ने अपने भाग्य को कोसा ।\n\n" +
                    "उधर, रानी की बहन ने सोचा कि मेरी बहन की दासी आई थी, परन्तु मैं उससे नहीं बोली, इससे वह बहुत दुखी हुई होगी । कथा सुनकर और पूजन समाप्त कर वह अपनी बहन के घर गई और कहने लगी, हे बहन । मैं वृहस्पतिवार का व्रत कर रही थी । तुम्हारी दासी गई परन्तु जब तक कथा होती है, तब तक न उठते है और न बोलते है, इसीलिये मैं नहीं बोली । कहो, दासी क्यों गई थी ।\n\n" +
                    "रानी बोली, बहन । हमारे घर अनाज नहीं था । ऐसा कहते-कहते रानी की आंखें भर आई । उसने दासियों समेत भूखा रहने की बात भी अपनी बहन को बता दी । रानी की बहन बोली, बहन देखो । वृहस्पतिदेव भगवान सबकी मनोकामना पूर्ण करते है । देखो, शायद तुम्हारे घर में अनाज रखा हो । यह सुनकर दासी घर के अन्दर गई तो वहाँ उसे एक घड़ा अनाज का भरा मिल गया । उसे बड़ी हैरानी हुई क्योंकि उसे एक एक बर्तन देख लिया था । उसने बाहर आकर रानी को बताया । दासी रानी से कहने लगी, हे रानी ।\n\n" +

                    "जब हमको भोजन नहीं मिलता तो हम व्रत ही तो करते है, इसलिये क्यों न इनसे व्रत और कथा की विधि पूछ ली जाये, हम भी व्रत किया करेंगे । दासी के कहने पर रानी ने अपनी बहन से वृहस्पतिवार व्रत के बारे में पूछा । उसकी बहन ने बताया, वृहस्पतिवार के व्रत में चने की दाल और मुनक्का से विष्णु भगवान का केले की जड़ में पूजन करें तथा दीपक जलायें । पीला भोजन करें तथा कथा सुनें । इससे गुरु भगवान प्रसन्न होते है, मनोकामना पूर्ण करते है । व्रत और पूजन की विधि बताकर रानी की बहन अपने घर लौट आई ।\n\n" +

                    "रानी और दासी दोनों ने निश्चय किया कि वृहस्पतिदेव भगवान का पूजन जरुर करेंगें । सात रोज बाद जब वृहस्पतिवार आया तो उन्होंने व्रत रखा । घुड़साल में जाकर चना और गुड़ बीन लाईं तथा उसकी दाल से केले की जड़ तथा विष्णु भगवान का पूजन किया । अब पीला भोजन कहाँ से आए । दोनों बड़ी दुखी हुई । परन्तु उन्होंने व्रत किया था इसलिये वृहस्पतिदेव भगवान प्रसन्न थे । एक साधारण व्यक्ति के रुप में वे दो थालों में सुन्दर पीला भोजन लेकर आए और दासी को देकर बोले, हे दासी । यह भोजन तुम्हारे लिये और तुम्हारी रानी के लिये है, इसे तुम दोनों ग्रहण करना । दासी भोजन पाकर बहुत प्रसन्न हुई । उसने रानी को सारी बात बतायी ।\n\n" +

                    "उसके बाद से वे प्रत्येक वृहस्पतिवार को गुरु भगवान का व्रत और पूजन करने लगी । वृहस्पति भगवान की कृपा से उनके पास धन हो गया । परन्तु रानी फिर पहले की तरह आलस्य करने लगी । तब दासी बोली, देखो रानी । तुम पहले भी इस प्रकार आलस्य करती थी, तुम्हें धन के रखने में कष्ट होता था, इस कारण सभी धन नष्ट हो गाय । अब गुरु भगवान की कृपा से धन मिला है तो फिर तुम्हें आलस्य होता है । बड़ी मुसीबतों के बाद हमने यह धन पाया है, इसलिये हमें दान-पुण्य करना चाहिये । अब तुम भूखे मनुष्यों को भोजन कराओ, प्याऊ लगवाओ, ब्राहमणों को दान दो, कुआं-तालाब-बावड़ी आदि का निर्माण कराओ, मन्दिर-पाठशाला बनवाकर ज्ञान दान दो, कुंवारी कन्याओं का विवाह करवाओ अर्थात् धन को शुभ कार्यों में खर्च करो, जिससे तुम्हारे कुल का यश बढ़े तथा स्वर्ग प्राप्त हो और पित्तर प्रसन्न हों । दासी की बात मानकर रानी शुभ कर्म करने लगी । उसका यश फैलने लगा ।\n\n" +

                    "एक दिन रानी और दासी आपस में विचार करने लगीं कि न जाने राजा किस दशा में होंगें, उनकी कोई खोज खबर भी नहीं है । उन्होंने श्रद्घापूर्वक गुरु (वृहस्पति) भगवान से प्रार्थना की कि राजा जहाँ कहीं भी हो, शीघ्र वापस आ जाएं ।\n\n" +
                    "उधर, राजा परदेश में बहुत दुखी रहने लगा । वह प्रतिदिन जंगल से लकड़ी बीनकर लाता और उसे शहर में बेचकर अपने दुखी जीवन को बड़ी कठिनता से व्यतीत करता । एक दिन दुखी हो, अपनी पुरानी बातों को याद करके वह रोने लगा और उदास हो गया ।\n\n" +
                    "उसी समय राजा के पास वृहस्पतिदेव साधु के वेष में आकर बोले, हे लकड़हारे । तुम इस सुनसान जंगल में किस चिंता में बैठे हो, मुझे बतलाओ । यह सुन राजा के नेत्रों में जल भर आया । साधु की वंदना कर राजा ने अपनी संपूर्ण कहानी सुना दी । महात्मा दयालु होते है । वे राजा से बोले, हे राजा तुम्हारी पत्नी ने वृहस्पतिदेव के प्रति अपराध किया था, जिसके कारण तुम्हारी यह दशा हुई । अब तुम चिन्ता मत करो भगवान तुम्हें पहले से अधिक धन देंगें । देखो, तुम्हारी पत्नी ने वृहस्पतिवार का व्रत प्रारम्भ कर दिया है । अब तुम भी वृहस्पतिवार का व्रत करके चने की दाल व गुड़ जल के लोटे में डालकर केले का पूजन करो । फिर कथा कहो या सुनो । भगवान तुम्हारी सब कामनाओं को पूर्ण करेंगें ।\n\n" +
                    " साधु की बात सुनकर राजा बोला, हे प्रभो । लकड़ी बेचकर तो इतना पैसा भई नहीं बचता, जिससे भोजन के उपरांत कुछ बचा सकूं । मैंने रात्रि में अपनी रानी को व्याकुल देखा है । मेरे पास कोई साधन नही, जिससे उसका समाचार जान सकूं । फिर मैं कौन सी कहानी कहूं, यह भी मुझको मालूम नहीं है । साधु ने कहा, हे राजा । मन में वृहस्पति भगवान के पूजन-व्रत का निश्चय करो । वे स्वयं तुम्हारे लिये कोई राह बना देंगे । वृहस्पतिवार के दिन तुम रोजाना की तरह लकड़ियां लेकर शहर में जाना । तुम्हें रोज से दुगुना धन मिलेगा जिससे तुम भलीभांति भोजन कर लोगे तथा वृहस्पतिदेव की पूजा का सामान भी आ जायेगा । जो तुमने वृहस्पतिवार की कहानी के बारे में पूछा है, वह इस प्रकार है \n\n" +
                    "वृहस्पतिदेव की कहानी" +
                    "प्राचीनकाल में एक बहुत ही निर्धन ब्राहमण था । उसके कोई संन्तान न थी । वह नित्य पूजा-पाठ करता, उसकी स्त्री न स्नान करती और न किसी देवता का पूजन करती । इस कारण ब्राहमण देवता बहुत दुखी रहते थे ।\n\n" +
                    "भगवान की कृपा से ब्राहमण के यहां एक कन्या उत्पन्न हुई । कन्या बड़ी होने लगी । प्रातः स्नान करके वह भगवान विष्णु का जप करती । वृहस्पतिवार का व्रत भी करने लगी । पूजा पाठ समाप्त कर पाठशाला जाती तो अपनी मुट्ठी में जौ भरके ले जाती और पाठशाला के मार्ग में डालती जाती । लौटते समय वही जौ स्वर्ण के हो जाते तो उनको बीनकर घर ले आती । एक दिन वह बालिका सूप में उन सोने के जौ को फटककर साफ कर रही थी कि तभी उसकी मां ने देख लिया और कहा, कि हे बेटी । सोने के जौ को फटकने के लिये सोने का सूप भी तो होना चाहिये ।\n\n" +
                    "दूसरे दिन गुरुवार था । कन्या ने व्रत रखा और वृहस्पतिदेव से सोने का सूप देने की प्रार्थना की । वृहस्पतिदेव ने उसकी प्रार्थना स्वीकार कर ली । रोजाना की तरह वह कन्या जौ फैलाती हुई पाठशाला चली गई । पाठशाला से लौटकर जब वह जौ बीन रही थी तो वृहस्पतिदेव की कृपा से उसे सोने का सूप मिला । उसे वह घर ले आई और उससे जौ साफ करने लगी । परन्तु उसकी मां का वही ढंग रहा ।\n\n" +
                    "एक दिन की बात है । कन्य सोने के सूप में जब जौ साफ कर रही थी, उस समय उस नगर का राजकुमार वहां से निकला । कन्या के रुप और कार्य को देखकर वह उस पर मोहित हो गया । राजमहल आकर वह भोजन तथा जल त्यागकर उदास होकर लेट गया ।<br><br>" +
                    "राजा को जब राजकुमार द्घारा अन्न-जल त्यागने का समाचार ज्ञात हुआ तो अपने मंत्रियों के साथ वह अपने पुत्र के पास गया और कारण पूछा । राजकुमार ने राजा को उस लड़की के घर का पता भी बता दिया । मंत्री उस लड़की के घर गया । मंत्री ने ब्राहमण के समक्ष राजा की ओर से निवेदन किया । कुछ ही दिन बाद ब्राहमण की कन्या का विवाह राजकुमार के साथ सम्पन्न हो गाया ।\n\n" +
                    "कन्या के घर से जाते ही ब्राहमण के घर में पहले की भांति गरीबी का निवास हो गया । एक दिन दुखी होकर ब्राहमण अपनी पुत्री से मिलने गये । बेटी ने पिता की अवस्था को देखा और अपनी माँ का हाल पूछा ब्राहमण ने सभी हाल कह सुनाया । कन्या ने बहुत-सा धन देकर अपने पिता को विदा कर दिया । लेकिन कुछ दिन बाद फिर वही हाल हो गया । ब्राहमण फिर अपनी कन्या के यहां गया और सभी हाल कहातो पुत्री बोली, हे पिताजी । आप माताजी को यहाँ लिवा लाओ । मैं उन्हें वह विधि बता दूंगी, जिससे गरीबी दूर हो जाए । ब्राहमण देवता अपनी स्त्री को साथ लेकर अपनी पुत्री के पास राजमहल पहुंचे तो पुत्री अपनी मां को समझाने लगी, हे मां, तुम प्रातःकाल स्नानादि करके विष्णु भगवन का पूजन करो तो सब दरिद्रता दूर हो जाएगी । परन्तु उसकी मां ने उसकी एक भी बात नहीं मानी । वह प्रातःकाल उठकर अपनी पुत्री की बची झूठन को खा लेती थी ।\n\n" +
                    "एक दिन उसकी पुत्री को बहुत गुस्सा आया, उसने अपनी माँ को एक कोठरी में बंद कर दिया । प्रातः उसे स्नानादि कराके पूजा-पाठ करवाया तो उसकी माँ की बुद्घि ठीक हो गई।\n\n" +
                    "इसके बाद वह नियम से पूजा पाठ करने लगी और प्रत्येक वृहस्पतिवार को व्रत करने लगी । इस व्रत के प्रभाव से मृत्यु के बाद वह स्वर्ग को गई । वह ब्राहमण भी सुखपूर्वक इस लोक का सुख भोगकर स्वर्ग को प्राप्त हुआ । इस तरह कहानी कहकर साधु बने देवता वहाँ से लोप हो गये ।\n\n" +
                    "धीरे-धीरे समय व्यतीत होने पर फिर वृहस्पतिवार का दिन आया । राजा जंगल से लकड़ी काटकर शहर में बेचने गया । उसे उस दिन और दिनों से अधिक धन मिला । राजा ने चना, गुड़ आदि लाकर वृहस्पतिवार का व्रत किया । उस दिन से उसके सभी क्लेश दूर हुए । परन्तु जब अगले गुरुवार का दिन आया तो वह वृहस्पतिवार का व्रत करना भूल गया । इस कारण वृहस्पति भगवान नाराज हो गए ।\n\n" +
                    "उस दिन उस नगर के राजा ने विशाल यज्ञ का आयोजन किया था तथा अपने समस्त राज्य में घोषणा करवा दी कि सभी मेरे यहां भोजन करने आवें । किसी के घर चूल्हा न जले । इस आज्ञा को जो न मानेगा उसको फांसी दे दी जाएगी ।\n\n" +
                    "राजा की आज्ञानुसार राज्य के सभी वासी राजा के भोज में सम्मिलित हुए लेकिन लकड़हारा कुछ देर से पहुंचा, इसलिये राजा उसको अपने साथ महल में ले गए । जब राजा लकड़हारे को भोजन करा रहे थे तो रानी की दृष्टि उस खूंटी पर पड़ी, जिस पर उसका हारलटका हुआ था । उसे हार खूंटी पर लटका दिखाई नहीं दिया । रानी को निश्चय हो गया कि मेरा हार इस लकड़हारे ने चुरा लिया है । उसी समय सैनिक बुलवाकर उसको जेल में डलवा दिया ।\n\n" +
                    "लकड़हारा जेल में विचार करने लगा कि न जाने कौन से पूर्वजन्म के कर्म से मुझे यह दुख प्राप्त हुआ है और जंगल में मिले साधु को याद करने लगा । तत्काल वृहस्पतिदेव साधु के रुप में प्रकट हो गए और कहने लगे, अरे मूर्ख । तूने वृहस्पति देवता की कथा नहीं की, उसी कारण तुझे यह दुख प्राप्त हुआ हैं । अब चिन्ता मत कर । वृहस्पतिवार के दिन जेलखाने के दरवाजे पर तुझे चार पैसे पड़े मिलेंगे, उनसे तू वृहस्पतिवार की पूजा करना तो तेर सभी कष्ट दूर हो जायेंगे ।\n\n" +
                    "अगले वृहस्पतिवार उसे जेल के द्घार पर चार पैसे मिले । राजा ने पूजा का सामान मंगवाकर कथा कही और प्रसाद बाँटा । उसी रात्रि में वृहस्पतिदेव ने उस नगर के राजा को स्वप्न में कहा, हे राजा । तूने जिसे जेल में बंद किया है, उसे कल छोड़ देना । वह निर्दोष है । राजा प्रातःकाल उठा और खूंटी पर हार टंगा देखकर लकड़हारे को बुलाकर क्षमा मांगी तथा राजा के योग्य सुन्दर वस्त्र-आभूषण भेंट कर उसे विदा किया ।\n\n" +
                    "गुरुदेव की आज्ञानुसार राजा अपने नगर को चल दिया । राजा जब नगर के निकट पहुँचा तो उसे बड़ा ही आश्चर्य हुआ । नगर में पहले से अधिक बाग, तालाब और कुएं तथा बहुत-सी धर्मशालाएं, मंदिर आदि बने हुए थे । राजा ने पूछा कि यह किसका बाग और धर्मशाला है । तब नगर के सब लोग कहने लगे कि यह सब रानी और दासी द्घारा बनवाये गए है । राजा को आश्चर्य हुआ और गुस्सा भी आया कि उसकी अनुपस्थिति में रानी के पास धन कहां से आया होगा ।\n\n" +
                    "जब रानी ने यह खबर सुनी कि राजा आ रहे है तो उसने अपनी दासी से कहा, हे दासी । देख, राजा हमको कितनी बुरी हालत में छोड़ गये थे । वह हमारी ऐसी हालत देखकर लौट न जाएं, इसलिये तू दरवाजे पर खड़ी हो जा । रानी की आज्ञानुसार दासी दरवाजे पर खड़ी हो गई और जब राजा आए तो उन्हें अपने साथ महल में लिवा लाई । तब राजा ने क्रोध करके अपनी तलवार निकाली और पूछने लगा, बताओ, यह धन तुम्हें कैसे प्राप्त हुआ है । तब रानी ने सारी कथा कह सुनाई ।\n\n" +
                    "राजा ने निश्चय किया कि मैं रोजाना दिन में तीन बार कहानी कहा करुंगा और रोज व्रत किया करुंगा । अब हर समय राजा के दुपट्टे में चने की दाल बंधी रहती तथा दिन में तीन बार कथा कहता ।\n\n" +
                    "एक रोज राजा ने विचार किया कि चलो अपनी बहन के यहां हो आऊं । इस तरह का निश्चय कर राजा घोड़े पर सवार हो अपनी बहन के यहां चल दिया । मार्ग में उसने देखा कि कुछ आदमी एक मुर्दे को लिये जा रहे है । उन्हें रोककर राजा कहने लगा, अरे भाइयो । मेरी वृहस्पतिवार की कथा सुन लो । वे बोले, लो, हमारा तो आदमी मर गया है, इसको अपनी कथा की पड़ी है । परन्तु कुछ आदमी बोले, अच्छा कहो, हम तुम्हारी कथा भी सुनेंगें । राजा ने दाल निकाली और कथा कहनी शुरु कर दी । जब कथा आधी हुई तो मुर्दा हिलने लगा और जब कथा समाप्त हुई तो राम-राम करके वह मुर्दा खड़ा हो गया।\n\n" +
                    "राजा आगे बढ़ा । उसे चलते-चलते शाम हो गई । आगे मार्ग में उसे एक किसान खेत में हल चलाता मिला । राजा ने उससे कथा सुनने का आग्रह किया, लेकिन वह नहीं माना ।\n\n" +
                    "राजा आगे चल पड़ा । राजा के हटते ही बैल पछाड़ खाकर गिर गए तथा किसान के पेट में बहुत जो रसे द्रर्द होने लगा ।\n\n" +
                    "उसी समय किसान की मां रोटी लेकर आई । उसने जब देखा तो अपने पुत्र से सब हाल पूछा । बेटे ने सभी हाल बता दिया । बुढ़िया दौड़-दौड़ी उस घुड़सवार के पास पहुँची और उससे बोली, मैं तेरी कथा सुनूंगी, तू अपनी कथा मेरे खेत पर ही चलकर कहना । राजा ने लौटकर बुढ़िया के खेत पर जाकर कथा कही, जिसके सुनते ही बैल खड़े हो गये तथा किसान के पेट का दर्द भी बन्द हो गया ।\n\n" +
                    "राजा अपनी बहन के घर पहुंच गया । बहन ने भाई की खूब मेहमानी की । दूसरे रोज प्रातःकाल राजा जागा तो वह देखने लगा कि सब लोग भोजन कर रहे है । राजा ने अपनी बहन से जब पूछा, ऐसा कोई मनुष्य है, जिसने भोजन नहीं किया हो । जो मेरी वृहस्पतिवार की कथा सुन ले । बहन बोली, हे भैया यह देश ऐसा ही है यहाँ लोग पहले भोजन करते है, बाद में कोई अन्य काम करते है । फिर वह एक कुम्हार के घर गई, जिसका लड़का बीमार था । उसे मालूम हुआ कि उसके यहां तीन दिन से किसीने भोजन नहीं किया है । रानी ने अपने भाई की कथा सुनने के लिये कुम्हार से कहा । वह तैयार हो गया । राजा ने जाकर वृहस्पतिवार की कथा कही । जिसको सुनकर उसका लड़का ठीक हो गया । अब तो राजा को प्रशंसा होने लगी । एक दिन राजा ने अपनी बहन से कहा, हे बहन । मैं अब अपने घर जाउंगा, तुम भी तैयार हो जाओ । राजा की बहन ने अपनी सास से अपने भाई के साथ जाने की आज्ञा मांगी । सास बोली हां चली जा मगर अपने लड़कों को मत ले जाना, क्योंकि तेरे भाई के कोई संतान नहीं होती है । बहन ने अपने भाई से कहा, हे भइया । मैं तो चलूंगी मगर कोई बालक नहीं जायेगा । अपनी बहन को भी छोड़कर दुखी मन से राजा अपने नगर को लौट आया । राजा ने अपनी रानी से सारी कथा बताई और बिना भोजन किये वह शय्या पर लेट गया । रानी बोली, हे प्रभो । वृहस्पतिदेव ने हमें सब कुछ दिया है, वे हमें संतान अवश्य देंगें । उसी रात वृहस्पतिदेव ने राजा को स्वप्न में कहा, हे राजा । उठ, सभी सोच त्याग दे । तेरी रानी गर्भवती है । राजा को यह जानकर बड़ी खुशी हुई । नवें महीन रानी के गर्भ से एक सुंदर पुत्र पैदा हुआ । तब राजा बोला, हे रानी । स्त्री बिना भोजन के रह सकती है, परन्तु बिना कहे नहीं रह सकती । जब मेरी बहन आये तो तुम उससे कुछ मत कहना । रानी ने हां कर दी । जब राजा की बहन ने यह श तथा बधाई लेकर अपने भाई के यहां आई । रानी ने तब उसे आने का उलाहना दिया, जब भाई अपने साथ ला रहे थे, तब टाल गई । उनके साथ न आई और आज अपने आप ही भागी-भागी बिना बुलाए आ गई । तो राजा की बहन बोली, भाई । मैं इस प्रकार न कहती तो तुम्हारे घर औलाद कैसे होती ।\n\n" +
                    "वृहस्पतिदेव सभी कामनाएं पूर्ण करते है । जो सदभावनापूर्वक वृहस्पतिवार का व्रत करता है एवं कथा पढ़ता है अथवा सुनता है और दूसरों को सुनाता है, वृहस्पतिदेव उसकी सभी मनोकामनाएं पूर्ण करते है, उनकी सदैव रक्षा करते है ।\n\n" +
                    "जो संसार में सदभावना से गुरुदेव का पूजन एवं व्रत सच्चे हृदय से करते है, उनकी सभी मनकामनाएं वैसे ही पूर्ण होती है, जैसी सच्ची भावना से रानी और राजा ने वृहस्पतिदेव की कथा का गुणगान किया, तो उनकी सभी इच्छाएं वृहस्पतिदेव जी ने पूर्ण की । अनजाने में भी वृहस्पतिदेव की उपेक्षा न करें । ऐसा करने से सुख-शांति नष्ट हो जाती है । इसलिये सबको कथा सुनने के बाद प्रसाद लेकर जाना चाहिये । हृदय से उनका मनन करते हुये जयकारा बोलना चाहिये ।\n\n";
           detail.setText(text1);
        }

        if(s.equals("three")) {
            image = (ImageView) (findViewById(com.vivek.hack.katha_app.R.id.imageView));
            image.setImageResource(com.vivek.hack.katha_app.R.drawable.image4);
            t1 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt1));
            t1.setText("श्रीसत्यनारायण व्रत कथा");
            t2 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt2));
            t2.setText("व्रत की विधि");

            TextView textnew;
            textnew = (TextView)(findViewById(R.id.txt3));

            String text;

            text = "\nसत्यनारायण का पूजन जीवन में सत्य के महत्तव को बतलाता है। इस दिन स्नान करके कोरे अथवा धुले हुए शुद्ध वस्त्र पहनें। माथे पर तिलक लगाएं। अब भगवान गणेश का नाम लेकर पूजन शुरु करें।\n\n" +
                    "देव मूर्ति के स्नान के लिए तांबे का पात्र, तांबे का लोटा, जल का कलश, दूध, देव मूर्ति को अर्पित किए जाने वाले वस्त्र व आभूषण। चावल, कुमकुम, दीपक, तेल, रुई, धूपबत्ती, फूल, अष्टगंध। तुलसीदल, तिल, जनेऊ। प्रसाद के लिए गेंहू के आटे की पंजीरी, फल, दूध, मिठाई, नारियल, पंचामृत, सूखे मेवे, शक्कर, पान में से जो भी हो सवाया लें।\n";
            textnew.setText(text);
            t3 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt4));
            t3.setText("व्रत की कथा:");

            TextView detail;
            detail = (TextView)(findViewById(R.id.txt5));

            String text1;

            text1 = "\nएक बार योगी नारद जी ने भ्रमण करते हुए मृत्युलोक के प्राणियों को अपने-अपने कर्मों के अनुसार तरह-तरह के दुखों से परेशान होते देखा. इससे उनका संतहृदय द्रवित हो उठा और वे वीणा बजाते हुए अपने परम आराध्य भगवान श्रीहरि की शरण में हरि कीर्तन करते क्षीरसागर पहुंच गये और स्तुतिपूर्वक बोले, ‘हे नाथ! यदि आप मेरे ऊपर प्रसन्न हैं तो मृत्युलोक के प्राणियों की व्यथा हरने वाला कोई छोटा-सा उपाय बताने की कृपा करें.’ तब भगवान ने कहा, ‘हे वत्स! तुमने विश्वकल्याण की भावना से बहुत सुंदर प्रश्न किया है. अत: तुम्हें साधुवाद है. आज मैं तुम्हें ऐसा व्रत बताता हूं जो स्वर्ग में भी दुर्लभ है और महान पुण्यदायक है तथा मोह के बंधन को काट देने वाला है और वह है श्रीसत्यनारायण व्रत. इसे विधि-विधान से करने पर मनुष्य सांसारिक सुखों को भोगकर परलोक में मोक्ष प्राप्त कर लेता है.’\n\n" +
                    "इसके बाद काशीपुर नगर के एक निर्धन ब्राह्मण को भिक्षावृत्ति करते देख भगवान विष्णु स्वयं ही एक बूढ़े ब्राह्मण के रूप में उस निर्धन ब्राह्मïण के पास जाकर कहते हैं, ‘हे विप्र! श्री सत्यनारायण भगवान मनोवांछित फल देने वाले हैं. तुम उनके व्रत-पूजन करो जिसे करने से मुनष्य सब प्रकार के दुखों से मुक्त हो जाता है. इस व्रत में उपवास का भी अपना महत्व है किंतु उपवास से मात्र भोजन न लेना ही नहीं समझना चाहिए. उपवास के समय हृदय में यह धारणा होनी चाहिए कि आज श्री सत्यनारायण भगवान हमारे पास ही विराजमान हैं. अत: अंदर व बाहर शुचिता बनाये रखनी चाहिए और श्रद्धा-विश्वासपूर्वक भगवान का पूजन कर उनकी मंगलमयी कथा का श्रवण करना चाहिए.’ सायंकाल में यह व्रत-पूजन अधिक प्रशस्त माना जाता है.\n\n" +
                    "श्री सत्यनारायण की कथा बताती है कि व्रत-पूजन करने में मानवमात्र का समान अधिकार है. चाहे वह निर्धन, धनवान, राजा हो या व्यवसायी, ब्राह्मण हो या अन्य वर्ग, स्त्री हो या पुरुष. यही स्पष्ट करने के लिए इस कथा में निर्धन ब्राह्मण, गरीब लकड़हारा, राजा उल्कामुख, धनवान व्यवसायी, साधु वैश्य, उसकी पत्नी लीलावती, पुत्री कलावती, राजा तुङ्गध्वज एवं गोपगणों की कथा का समावेश किया गया है.\n\n" +
                    "कथासार ग्रहण करने से यह निष्कर्ष निकलता है कि जिस किसी ने सत्य के प्रति श्रद्धा-विश्वास किया, उन सबके कार्य सिद्ध हो गये. जैसे लकड़हारा, गरीब ब्राह्मण, उल्कामुख, गोपगणों ने सुना कि यह व्रत सुख, सौभाग्य, संतति, संपत्ति सब कुछ देने वाला है तो सुनते ही श्रद्धा, भक्ति तथा प्रेम के साथ सत्यव्रत का आचरण करने में लग गये और फलस्वरूप इहलौकिक सुख भोगकर परलोक में मोक्ष के अधिकारी हुए.\n\n" +
                    "साधु वैश्य ने भी यही प्रसंग राजा उल्कामुख से विधि-विधान के साथ सुना, किंतु उसका विश्वास अधूरा था. श्रद्धा में कमी थी. वह कहता था कि संतान प्राप्ति पर सत्यव्रत-पूजन करूंगा. समय बीतने पर उसके घर एक सुंदर कन्या ने जन्म लिया. उसकी श्रद्धालु पत्नी ने व्रत की याद दिलायी तो उसने कहा कि कन्या के विवाह के समय करेंगे.\n\n" +
                    "समय आने पर कन्या का विवाह भी हो गया किंतु उस वैश्य ने व्रत नहीं किया. वह अपने दामाद को लेकर व्यापार के लिए चला गया. उसे चोरी के आरोप में राजा चन्द्रकेतु द्वारा दामाद सहित कारागार में डाल दिया गया. पीछे घर में भी चोरी हो गयी. पत्नी लीलावती व पुत्री कलावती भिक्षावृत्ति के लिए विवश हो गयीं. एक दिन कलावती ने किसी विप्र के घर श्री सत्यनारायण का पूजन होते देखा और घर आकर मां को बताया. तब मां ने अगले दिन श्रद्धा से व्रत-पूजन कर भगवान से पति और दामाद के शीघ्र वापस आने का वरदान मांगा. श्रीहरि प्रसन्न हो गये और स्वप्न में राजा को दोनों बंदियों को छोडऩे का आदेश दिया. राजा ने उनका धन-धान्य तथा प्रचुर द्रव्य देकर उन्हें विदा किया. घर आकर पूर्णिमा और संक्रांति को सत्यव्रत का जीवन पर्यन्त आयोजन करता रहा, फलत: सांसारिक सुख भोगकर उसे मोक्ष प्राप्त हुआ.\n\n" +
                    "इसी प्रकार राजा तुङ्गध्वज ने वन में गोपगणों को श्री सत्यनारायण भगवान का पूजन करते देखा, किंतु प्रभुता के मद में चूर राजा न तो पूजास्थल पर गया, न दूर से ही प्रणाम किया और न ही गोपगणों द्वारा दिया प्रसाद ग्रहण किया. परिणाम यह हुआ कि राजा के पुत्र, धन-धान्य, अश्व-गजादि सब नष्ट हो गये. राजा को अकस्मात् यह आभास हुआ कि विपत्ति का कारण सत्यदेव भगवान का निरादर है. उसे बहुत पश्चाताप हुआ. वह तुरंत वन में गया. गोपगणों को बुलाकर काफी समय लगाकर सत्यनारायण भगवान की पूजा की. फिर उसने उनसे ही प्रसाद ग्रहण किया तथा घर आ गया. उसने देखा कि विपत्ति टल गयी और उसकी सारी संपत्ति तथा जन सुरक्षित हो गये. राजा प्रसन्नता से भर गया और सत्यव्रत के आचरण में निरत हो गया तथा अपना सर्वस्व भगवान को अर्पित कर दिया.\n\n" +
                    "श्री सत्यनारायण व्रत से हमें शिक्षा मिलती है कि सत्यरूप ब्रह्म जीवात्मा रूप में हमारे अंदर विद्यमान है. हम सब सत्य के ही स्वरूप हैं, पर माया के वश में आकर नष्ट होने वाली वस्तुओं को संग्रह करने की सोचकर संसार में मग्न हो रहे हैं. इस अज्ञान को दूर करके सत्य को स्वीकार करना और प्रभु की भक्ति करना ही मानव का धर्म है. यही सत्यनारायण व्रत और कथा का सार है.\n\n";

            detail.setText(text1);
        }

        if(s.equals("four")) {
            image = (ImageView) (findViewById(com.vivek.hack.katha_app.R.id.imageView));
            image.setImageResource(com.vivek.hack.katha_app.R.drawable.image5);
            t1 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt1));
            t1.setText("वैभव लक्ष्मी व्रत कथा");
            t2 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt2));
            t2.setText("व्रत की विधि");

            TextView textnew;

            textnew = (TextView)(findViewById(R.id.txt3));

            String text;

            text = "\nइस व्रत को करने से उपासक को धन और सुख-समृ्द्धि की प्राप्ति होती है. घर-परिवार में लक्ष्मी का वास बनाए रखने के लिए भी यह व्रत उपयोगी है. इस दिन स्त्री-पुरुष लक्ष्मी की पूजा करते हुए सफेद फूल, सफेद चंदन आदि से पूजा करते हैं. खीर से भगवान को भोग लगाकर प्रसाद ग्रहण करते हैं. इस व्रत के दिन उपासक को एक समय भोजन करना चाहिए. अगर कोई व्यक्ति माता वैभव लक्ष्मी का व्रत करने के साथ ही लक्ष्मी श्री यंत्र को स्थापित कर उसकी नियमित रूप से पूजा करता है, तो उसके व्यापार में वृ्द्धि ओर धन में बढोतरी होती है.";
            textnew.setText(text);


            t3 = (TextView) (findViewById(com.vivek.hack.katha_app.R.id.txt4));
            t3.setText("व्रत की कथा:");

            TextView detail;
            detail = (TextView)(findViewById(R.id.txt5));
            String text1;

            text1 = "\nकिसी शहर में अनेक लोग रहते थे. सभी अपने-अपने कामों में लगे रहते थे. किसी को किसी की परवाह नहीं थी. भजन-कीर्तन, भक्ति-भाव, दया-माया, परोपकार जैसे संस्कार कम हो गए. शहर में बुराइयां बढ़ गई थीं. शराब, जुआ, रेस, व्यभिचार, चोरी-डकैती वगैरह बहुत से गुनाह शहर में होते थे. इनके बावजूद शहर में कुछ अच्छे लोग भी रहते थे.\n\n" +
                    "ऐसे ही लोगों में शीला और उनके पति की गृहस्थी मानी जाती थी. शीला धार्मिक प्रकृति की और संतोषी स्वभाव वाली थी. उनका पति भी विवेकी और सुशील था. शीला और उसका पति कभी किसी की बुराई नहीं करते थे और प्रभु भजन में अच्छी तरह समय व्यतीत कर रहे थे. शहर के लोग उनकी गृहस्थी की सराहना करते थे.\n\n" +
                    "देखते ही देखते समय बदल गया. शीला का पति बुरे लोगों से दोस्ती कर बैठा. अब वह जल्द से जल्द करोड़पति बनने के ख्वाब देखने लगा. इसलिए वह गलत रास्ते पर चल पड़ा फलस्वरूप वह रोडपति बन गया. यानी रास्ते पर भटकते भिखारी जैसी उसकी हालत हो गई थी. शराब, जुआ, रेस, चरस-गांजा वगैरह बुरी आदतों में शीला का पति भी फंस गया. दोस्तों के साथ उसे भी शराब की आदत हो गई. इस प्रकार उसने अपना सब कुछ रेस-जुए में गंवा दिया.\n\n" +
                    "शीला को पति के बर्ताव से बहुत दुःख हुआ, किन्तु वह भगवान पर भरोसा कर सबकुछ सहने लगी. वह अपना अधिकांश समय प्रभु भक्ति में बिताने लगी. अचानक एक दिन दोपहर को उनके द्वार पर किसी ने दस्तक दी. शीला ने द्वार खोला तो देखा कि एक माँजी खड़ी थी. उसके चेहरे पर अलौकिक तेज निखर रहा था. उनकी आँखों में से मानो अमृत बह रहा था. उसका भव्य चेहरा करुणा और प्यार से छलक रहा था. उसको देखते ही शीला के मन में अपार शांति छा गई. शीला के रोम-रोम में आनंद छा गया. शीला उस माँजी को आदर के साथ घर में ले आई. घर में बिठाने के लिए कुछ भी नहीं था. अतः शीला ने सकुचाकर एक फटी हुई चद्दर पर उसको बिठाया.\n\n" +
                    "मांजी बोलीं- क्यों शीला! मुझे पहचाना नहीं? हर शुक्रवार को लक्ष्मीजी के मंदिर में भजन-कीर्तन के समय मैं भी वहां आती हूं.' इसके बावजूद शीला कुछ समझ नहीं पा रही थी. फिर मांजी बोलीं- 'तुम बहुत दिनों से मंदिर नहीं आईं अतः मैं तुम्हें देखने चली आई.'\n\n" +
                    "मांजी के अति प्रेमभरे शब्दों से शीला का हृदय पिघल गया. उसकी आंखों में आंसू आ गए और वह बिलख-बिलखकर रोने लगी. मांजी ने कहा- 'बेटी! सुख और दुःख तो धूप और छाँव जैसे होते हैं. धैर्य रखो बेटी! मुझे तेरी सारी परेशानी बता.'\n\n" +
                    "मांजी के व्यवहार से शीला को काफी संबल मिला और सुख की आस में उसने मांजी को अपनी सारी कहानी कह सुनाई.\n\n" +
                    "कहानी सुनकर माँजी ने कहा- 'कर्म की गति न्यारी होती है. हर इंसान को अपने कर्म भुगतने ही पड़ते हैं. इसलिए तू चिंता मत कर. अब तू कर्म भुगत चुकी है. अब तुम्हारे सुख के दिन अवश्य आएँगे. तू तो माँ लक्ष्मीजी की भक्त है. माँ लक्ष्मीजी तो प्रेम और करुणा की अवतार हैं. वे अपने भक्तों पर हमेशा ममता रखती हैं. इसलिए तू धैर्य रखकर माँ लक्ष्मीजी का व्रत कर. इससे सब कुछ ठीक हो जाएगा.'\n\n" +
                    "शीला के पूछने पर मांजी ने उसे व्रत की सारी विधि भी बताई. मांजी ने कहा- 'बेटी! मां लक्ष्मीजी का व्रत बहुत सरल है. उसे 'वरदलक्ष्मी व्रत' या 'वैभव लक्ष्मी व्रत' कहा जाता है. यह व्रत करने वाले की सब मनोकामना पूर्ण होती है. वह सुख-संपत्ति और यश प्राप्त करता है.'\n\n" +
                    "शीला यह सुनकर आनंदित हो गई. शीला ने संकल्प करके आँखें खोली तो सामने कोई न था. वह विस्मित हो गई कि मांजी कहां गईं? शीला को तत्काल यह समझते देर न लगी कि मांजी और कोई नहीं साक्षात् लक्ष्मीजी ही थीं.\n\n" +
                    "दूसरे दिन शुक्रवार था. सबेरे स्नान करके स्वच्छ कपड़े पहनकर शीला ने मांजी द्वारा बताई विधि से पूरे मन से व्रत किया. आखिरी में प्रसाद वितरण हुआ. यह प्रसाद पहले पति को खिलाया. प्रसाद खाते ही पति के स्वभाव में फर्क पड़ गया. उस दिन उसने शीला को मारा नहीं, सताया भी नहीं. शीला को बहुत आनंद हुआ. उनके मन में 'वैभवलक्ष्मी व्रत' के लिए श्रद्धा बढ़ गई.\n\n" +
                    "शीला ने पूर्ण श्रद्धा-भक्ति से इक्कीस शुक्रवार तक 'वैभवलक्ष्मी व्रत' किया. इक्कीसवें शुक्रवार को माँजी के कहे मुताबिक उद्यापन विधि कर के सात स्त्रियों को 'वैभवलक्ष्मी व्रत' की सात पुस्तकें उपहार में दीं. फिर माताजी के 'धनलक्ष्मी स्वरूप' की छबि को वंदन करके भाव से मन ही मन प्रार्थना करने लगीं- 'हे मां धनलक्ष्मी! मैंने आपका 'वैभवलक्ष्मी व्रत' करने की मन्नत मानी थी, वह व्रत आज पूर्ण किया है. हे मां! मेरी हर विपत्ति दूर करो. हमारा सबका कल्याण करो. जिसे संतान न हो, उसे संतान देना. सौभाग्यवती स्त्री का सौभाग्य अखंड रखना. कुंआरी लड़की को मनभावन पति देना. जो आपका यह चमत्कारी वैभवलक्ष्मी व्रत करे, उनकी सब विपत्ति दूर करना. सभी को सुखी करना. हे माँ! आपकी महिमा अपार है.' ऐसा बोलकर लक्ष्मीजी के 'धनलक्ष्मी स्वरूप' की छबि को प्रणाम किया.\n\n" +
                    "व्रत के प्रभाव से शीला का पति अच्छा आदमी बन गया और कड़ी मेहनत करके व्यवसाय करने लगा. उसने तुरंत शीला के गिरवी रखे गहने छुड़ा लिए. घर में धन की बाढ़ सी आ गई. घर में पहले जैसी सुख-शांति छा गई. 'वैभवलक्ष्मी व्रत' का प्रभाव देखकर मोहल्ले की दूसरी स्त्रियां भी विधिपूर्वक 'वैभवलक्ष्मी व्रत' करने लगीं.\n\n";
           detail.setText(text1);
        }

    }
    public boolean onOptionsItemSelected(MenuItem item) {
        switch (item.getItemId()) {
            case android.R.id.home:
                finish();
                return true;
        }

        return super.onOptionsItemSelected(item);
    }

    public boolean onCreateOptionsMenu(Menu menu) {
        return true;
    }
}
